# =============================================================
# 1. SAÍDA DE DADOS
# =============================================================
print("""
██╗░░░░░███████╗███╗░░░███╗░█████╗░░██████╗  ███████╗██╗░░██╗██████╗░██████╗░███████╗░██████╗░██████╗
██║░░░░░██╔════╝████╗░████║██╔══██╗██╔════╝  ██╔════╝╚██╗██╔╝██╔══██╗██╔══██╗██╔════╝██╔════╝██╔════╝
██║░░░░░█████╗░░██╔████╔██║██║░░██║╚█████╗░  █████╗░░░╚███╔╝░██████╔╝██████╔╝█████╗░░╚█████╗░╚█████╗░
██║░░░░░██╔══╝░░██║╚██╔╝██║██║░░██║░╚═══██╗  ██╔══╝░░░██╔██╗░██╔═══╝░██╔══██╗██╔══╝░░░╚═══██╗░╚═══██╗
███████╗███████╗██║░╚═╝░██║╚█████╔╝██████╔╝  ███████╗██╔╝╚██╗██║░░░░░██║░░██║███████╗██████╔╝██████╔╝
╚══════╝╚══════╝╚═╝░░░░░╚═╝░╚════╝░╚═════╝░  ╚══════╝╚═╝░░╚═╝╚═╝░░░░░╚═╝░░╚═╝╚══════╝╚═════╝░╚═════╝░
""")
print("1 - Cadastro de Clientes")
print("2 - Cadastro de Produtos")
print("3 - Cadastro de Pedidos")
print("4 - Relatórios")

# =============================================================
# 2. ENTRADA DE DADOS
# =============================================================
entrada_usuario = input("\nDigite a opção desejada: ")

# ==========================================
# 3. CONVERSÃO DA ENTRADA
# ==========================================
idade = int(input("Digite sua idade: "))

# =============================================================
# 4. CONCATENAÇÃO DE STRINGS
# =============================================================
print("=======================================================================")
print("CONCATENAÇÃO E INTERPOLAÇÃO DE STRINGS")
print("\nVocê selecionou a opção (concatenação): ", entrada_usuario )
print("Você selecionou a opção (concatenação): " + entrada_usuario)
print("Você tem ",idade, " anos.")

# =============================================================
# 5. INTERPOLAÇÃO DE STRINGS (f-strings)
# =============================================================
print(f"Você selecionou a opção (interpolação): {entrada_usuario}") 

# =============================================================
# .FORMAT()
# =============================================================
print("Você selecionou a opção (.format()): {}".format(entrada_usuario))

# =============================================================
# FORMATAÇÃO DE STRINGS ANTIGA(%) 
# =============================================================
print("Você selecionou a opção (formatação de string antiga): %s\n" % entrada_usuario)

# =============================================================
# 6. SEPARADOR DO PRINT
# =============================================================
print("=======================================================================")
print("SEPARADOR DO PRINT")
print("L","e","m","o","s", sep="\n")

print("Bem vindo aos estudos de Python", end=" ")
print("em 2026!")

# =============================================================
# 7. FORMATAÇÃO DE VALORES
# =============================================================
print("=======================================================================")
print("FORMATAÇÃO DE VALORES")
pi = 3.14159
numero_inteiro = 42
preco = 1234567.891
print(f"\nO valor de pi é: {pi:.2f}") # Formatação para exibir apenas 2 casas decimais
print("O valor de pi é: {:.2f}".format(pi)) # Formatação para exibir apenas 2 casas decimais
print("O valor de pi é: ", round(pi, 2)) # Formatação para exibir apenas 2 casas decimais
print(f"O valor do número inteiro é: {numero_inteiro:.2f}")
print(f"O valor do preço é: {preco:,.2f}") #1,234,567.89
# =============================================================
# 8. tipo de dados (type)
# =============================================================
print("=======================================================================")
print("TIPO DE DADOS (type) \n")
print(type(entrada_usuario))
print(type(idade))